Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K36.tmx
Source language: en_us
Languages: zh_cn

source: Bone Hinge
zh_cn: 与子同根

source: HATTIE MET HIM behind the dye vats, and me, I was forced to come along.
zh_cn: 海蒂和他在染缸后会面，还有我。我来是迫不得已。

source: Why did I agree to it?
zh_cn: 我为什么要同意？

source: All-morning whines, whispers, and pinches to the nape of my neck, that's why.
zh_cn: 整整一早上的牢骚、耳语，还有后脖颈上掐捏，这就是为什么。

source: We arrived in the factory yard just past noon, Hattie dragging us between looming metal drums, their caps locked down with bolts thick as my wrist.
zh_cn: 我们刚过正午就到了工厂大院，海蒂在笨重的铁桶间把我们拖来拽去，这些桶的盖子都上了拴，插销跟我的手腕一般粗。

source: "Slow down," I said.
zh_cn: “慢点儿，”我说。

source: She was near running, making me take quick tripping steps to keep pace.
zh_cn: 她几乎是在跑，我得跌跌绊绊迈着快步才能跟上。

source: I rapped the bit of bone and skin that joined Hattie and me at the base of our spines.
zh_cn: 我轻轻拍打着在脊椎底部把海蒂和我连在一起的那块骨头和皮肤。

source: More than twins, Mother said.
zh_cn: 不只是双胞胎啊，母亲说。

source: More than can be borne, the ladies at church sighed.
zh_cn: 可不是怀胎就行了的，女士们在教堂叹息说。

source: More than enough for me, the factory men whispered to each other, too low, they thought, for me to hear.
zh_cn: 我可要不了，工厂工人们互相窃窃私语，他们觉得声音太低了，我听不到。

source: "Hattie!
zh_cn: “海蒂！

source: Slow!"
zh_cn: 慢点儿！”

source: I insisted.
zh_cn: 我坚决地说。

source: She halted in the shadow of a vat, allowing me to regain my feet and breath.
zh_cn: 她停在一个染缸的阴影里，让我匀一匀呼吸和脚步。

source: "Sorry," she murmured. "Sorry. Sorry."
zh_cn: “对不起，”她嘟囔着，“对不起。对不起。”

source: She always apologized in triplicate.
zh_cn: 她道歉总是一式三份。

source: "You want to walk forward?"
zh_cn: “你要往前走吧？”

source: "I want to walk homeward," I said, but Hattie ignored this, starting on again, slower this time.
zh_cn: “我要往家走，”我说。但是海蒂并不理会，又迈开了步子，这次慢了些。

source: I could see where the loaders had scrawled on the dye vats' sides in wax crayon to identify the colors within.
zh_cn: 我可以看见染缸侧面，那儿有装货员用蜡笔草草划下的记号，用来识别里面的颜色。

source: Last summer I'd stolen Father's ledger and memorized all the codes.
zh_cn: 去年夏天我偷了父亲的账簿，把所有的记号都背了下来。

source: I said them silently as we walked: 5102-OL, olive; 8795-CY, cyan; 7999-YW, pale yellow.
zh_cn: 我们一边走，我一边默认：5102-OL，橄榄色；8795-CY，蓝绿色；7999-YW，淡黄色。

source: We rounded 4203-RD, bright red.
zh_cn: 我们绕着走的是4203-RD，鲜红色。

source: He lurked on the other side.
zh_cn: 他躲藏在另一面。

source: Before I knew it, he'd lifted Hattie up on her toes, and her breath escaped in a puff.
zh_cn: 还没等我知道，他就把海蒂脚尖离地举了起来，她吐出了一口气。

source: Matthew, a stuttering 19-year-old with a face as dull as Wednesday morning, met my sister in the dye yard because their love was forbidden.
zh_cn: 马修是一个19岁的口吃男孩，面孔像星期三早晨一样呆滞，他和姐姐的爱情是被禁止的，所以他们在染料大院里约会。

source: Matthew worked in Father's dye factory, fortunate to have a job when most of the rest of the town stood on the breadline.
zh_cn: 马修在父亲的染厂工作，镇上多数人都在排队领救济，他很幸运还有份工作。

source: All summer behind the vats, his hands had worked over Hattie.
zh_cn: 在染缸后，他的手一整个夏天都在海蒂全身上下忙个不停。

source: They were stained a different color every few weeks-blue, yellow, green, sometimes a dream-snarled purple.
zh_cn: 他们每过几星期就染上一种不同的颜色——蓝色、黄色、绿色，有时是一种梦幻的紫色。

source: That day, they were orange, a pallid fire that would soon flicker at Hattie's wrists, shoulders, and the insides of her thighs.
zh_cn: 那天，他们是橙色，一簇暗淡的火焰很快就会燃烧在海蒂的手腕、肩膀，和大腿内侧。

source: Matthew released my sister and walked around to address me with a few stiff words.
zh_cn: 马修松开姐姐，绕过来招呼我，拘谨的几句话。

source: "Morning, Sylvie."
zh_cn: “早上好，西尔维。”

source: "Matthew."
zh_cn: “马修。”

source: "Nice day, huh?"
zh_cn: “天气不错，嗯？”

source: I shrugged.
zh_cn: 我耸了耸肩。

source: He glanced at Hattie.
zh_cn: 他瞥了眼海蒂。

source: The ropes of her braids tickled my neck, which meant that she was nodding to him: Go on.
zh_cn: 她的辫绳一下一下挠着我的脖子，说明她在向他点头：继续。

source: "Sunny today," he said.
zh_cn: “今天阳光灿烂，”他说。

source: "Talk of weather." I yawned.
zh_cn: “说到天气了，”我打了个哈欠。

source: "They've doubled the number of dye vats," Matthew said.
zh_cn: “染缸的数量增加了一倍，”马修说。

source: "Did yuh-you notice?"
zh_cn: “尼-你注意到了吗？”

source: "Mmmm. Talk of dye vats."
zh_cn: “呣，呣，说到染缸了。”

source: I tapped my foot.
zh_cn: 我用脚点着地。

source: Hattie leaned her head back against my shoulder.
zh_cn: 海蒂把头向后顶在我的肩膀上。

source: "Don't you wish they'd bust open?" she asked.
zh_cn: “难道你们不希望他们快点打开吗？”她问道。

source: "Then we could go dip ourselves in any color we wanted."
zh_cn: “那样我们就可以想要什么颜色就浸在什么颜色里了。”

source: "What color would yuh-you choose, Hattie?"
zh_cn: “尼-你会选择哪种颜色，海蒂？”

source: Matthew asked.
zh_cn: 马修问。

source: "All of them."
zh_cn: “都要。”

source: "If you dipped yourself in all of them, you'd end up a disgusting brown," I informed her.
zh_cn: “如果你把自己浸在所有的颜色里，结果就会是一种恶心的褐色，”我告知她。

source: "You got to limit yourself to one.
zh_cn: “你得让自己只限一样。

source: Lester Byttle did."
zh_cn: 莱斯特·贝特尔就这样做。”

source: Hattie whipped the ends of her braids against my cheek.
zh_cn: 海蒂抽动辫梢打我的脸颊。

source: She hated when I talked about Lester Byttle, said the memory gave her nightmares.
zh_cn: 我一说莱斯特·贝尔特她就恨，说那个记忆让她做噩梦。

source: Lester had been famous among the line workers for a magic trick.
zh_cn: 莱斯特在一线员工中以一种魔术把戏而闻名。

source: He'd snatch up pinches of base powder in his long, thin hands and, with a sharp look, make it rise from his fingertips, swirling in the air, only to land in twin patches on an unsuspecting worker's cheeks or eyelids or lips, like a woman's face paint.
zh_cn: 他会把底粉撮取在那双修长的手中，眼中精光一现，就让它从指尖冉冉升起，在空气中打着旋儿，变成一模一样的两团，落在一个毫无防备的工人的脸颊上或者眼脸上或者嘴唇上，就像女人的面妆。

source: Lester had worked in the dye factory for years, since after his family had all burnt up in a house fire when he was a teenager.
zh_cn: 莱斯特十几岁的时候，家中起火，全家都烧死了，自那以后他就在染厂工作，好些年了。

source: The mystics said that Lester had started the blaze himself with a bad dream, Lester's nightmare a spark, the house a tinderbox.
zh_cn: 神秘主义者说，是莱斯特自己用恶梦点燃了火，他的恶梦是火星，他家屋子则是燃料箱。

source: The Byttle family had ended with fire; Hattie and I, we'd started out with fire, and I liked to think that maybe Lester had been dreaming again the night that we were born.
zh_cn: 贝特尔家与火同归；海蒂和我，我们则与火同生，我喜欢这么想：也许莱斯特在我们出生的那天晚上又在做梦。

source: "Got a new color today."
zh_cn: “今天有种新颜色。”

source: Matthew beamed and flashed us his dyed palms.
zh_cn: 马修微笑着，把他染了色的手掌向我们一闪一闪。

source: "Now, what would you call that?" I asked, steering him toward the unpronounceable.
zh_cn: “那么，你会叫它什么呢？”我问，一边引着他去发那个发不出的读音。

source: "Uh-oh-oh-oh ..."
zh_cn: “呃-哦-哦-哦......

source: He gulped like he couldn't breathe.
zh_cn: ”他大口吞咽就好像喘不上气。

source: "Oh-uh-oh ..."
zh_cn: “哦-呃-哦......”

source: "What?"
zh_cn: “什么？”

source: I cupped a hand to my ear.
zh_cn: 我把一只手搭在耳朵上。

source: "I can't quite-"
zh_cn: “我听不——”

source: "Orange," Hattie hissed, nudging me hard in the ribs.
zh_cn: “橙色，”海蒂咬牙切齿地说，使劲捅我的肋骨。

source: I caught the edge of her frown like a fishhook.
zh_cn: 我看见她眉头皱得像只鱼钩。

source: She turned from me to smooth Matthew's cheek and curl a finger round his ear.
zh_cn: 她转过去抚弄马修的脸颊，把手指绕在他的耳朵上。

source: "Ignore her," she murmured.
zh_cn: “别理她，”她喃喃细语。

source: "She's always in a bad mood."
zh_cn: “她总是心情不好。”

source: He nodded at me, muttering, "Sylvie," before ducking back into Hattie's caress.
zh_cn: 他向我点点头，咕哝了声，“西尔维，”便一头扎进了海蒂的爱抚中。

source: They leaned against 4203-RD and worked through their rote of tender gestures: hand-holding, modest-mouthed kisses, a giddy lowering to the ground, me an awkward weight following them down.
zh_cn: 他们倚靠在4203-RD上，一板一眼地做起那套温柔把式：拉手、深浅有度的亲吻、晕晕忽忽地往地上滑，我这个糟糕的重负则跟着他们倒地。

source: The dye wove its fingers up my nostrils and down the back of my throat, but I refused to choke as Matthew tangled his hands in Hattie's hair, pulling it from its braids so that it spilled around me where I sat behind them.
zh_cn: 染料丝丝缕缕钻入我的鼻孔，进到我的喉咙里，可我就是不呛出声，我坐在他们身后，马修的手缠绕在海蒂的发间，拉开了她的辫子，头发四散开来环绕着我。

source: It smelled of her pillow back home.
zh_cn: 我闻到家中她的枕头味儿。

source: Their bodies, when they kissed, produced a scent thick and sour like spoiled pudding, which mingled with the vinegar smell of the dye.
zh_cn: 他们亲吻的时候，身体发出一种浓重的酸腐味，像坏了的布丁，和染料的醋味混杂在一起。

source: Matthew ran his stained hands over Hattie's back and accidentally brushed mine.
zh_cn: 马修染着色的手在海蒂身上游走，偶尔会拂过我的。

source: I flinched.
zh_cn: 我缩了缩身子。

source: "Suh-sorry," he muttered.
zh_cn: “堆-对不起，”他嘟囔着。

source: "Suh-suh-" Hattie's mouth covered this last apology, locked down tight on his.
zh_cn: “堆-堆-”海蒂的嘴把最后这声道歉给盖住了，与他的嘴唇紧紧锁在一起。

source: I pressed my face against the rusting vat, stared up at the squatting clouds, and darted my tongue out to the cold metal to taste the tang of it, the rough of it.
zh_cn: 我把脸紧贴在锈迹斑斑的染缸上，凝视着低矮的云层，舌头一弹一弹地碰触冰冷的铁面，品尝它的味道、它的粗糙。

source: The place where we are joined is a secret place for Hattie and me, especially since everyone always wants to look at it.
zh_cn: 对于我和海蒂来说，我们相连的那个位置是个秘密部位，每个人都总是想看上一看，这让它显得尤其秘密。

source: The skin of our backs descends into a V, like a bird's wing does to its body-a bone hinge covered in smooth skin, our spines locked together at the base.
zh_cn: 我们背上的皮肤向下延伸成一个“V”，就像鸟儿身体上的翅膀——一段覆盖在光滑皮肤下，绞缠在一起的骨头。我们的脊椎在底部锁在一起。

source: We face away from each other, simply two girls standing back to back.
zh_cn: 我们就是两个背靠背站着的女孩，互不照面。

source: When walking somewhere, I let Hattie lead, because then I'm not obliged to wave to anyone or chirp some greeting that will likely not be returned.
zh_cn: 要去什么地方时，我就让海蒂领路，因为那样我就不必向人挥手或者叽叽喳喳地打招呼了，这些一般都得不到回应。

source: I trail with perfectly placed backward steps, looking at the world after Hattie has passed it, which makes it a little friendlier somehow.
zh_cn: 我倒退脚步跟行自如，打量着海蒂路过的世界，她的经过不知怎么使它变得友好些了。

source: Lately, though, Hattie hates our hinge.
zh_cn: 然而，后来，海蒂厌恨起我们的连体了。

source: She cranes to look at our backs and sighs.
zh_cn: 她伸长脖子看着我们的后背，叹着气。

source: She snaps at me if I move too slowly.
zh_cn: 如果我行动太慢，她就冲我嚷嚷。

source: I twist my neck, trying to catch her expression, but I can see only half of it: flutter of eye, curve of lip, and slice of cheek.
zh_cn: 我扭转脖子，想看看她的表情，可也只能看到一半儿：眼睛的煽动、嘴唇的弧度，面颊的一片儿。

source: I envy Matthew that, at least, being able to look at the full of Hattie's face.
zh_cn: 我羡慕马修，至少他能够看到海蒂的整个面庞。

source: People say her face is identical to mine, but I wonder if I'd think it so, if I were able to look at it.
zh_cn: 人们说她的脸与我的一模一样，然而如果我自己能够看见的话，我很怀疑自己是否也会这样认为。

source: In the two months since she took up with Matthew, Hattie's voice has spread thin as though it has been pumped full of air, and her movements are cloudy with sleepy flourishes.
zh_cn: 海蒂跟马修交往两个月后，她的声音轻柔，仿佛灌满了气，举手投足梦幻飘忽。

source: "You ill, Hats?," Father asked last night, his ear pressed to the radio.
zh_cn: “海蒂，你病了？”昨晚父亲耳朵贴着收音机，问道。

source: Mother clucked her tongue and held the back of her hand to Hattie's forehead.
zh_cn: 母亲哒哒地弹着舌，把手背贴放在海蒂的额头上。

source: Only I knew that Hattie was infected with a secret fever, more gruesome than either of them could imagine.
zh_cn: 只有我知道，海蒂被一种神秘的热病感染了，那比他们任何人所能想象到的还更可怕。

source: Up in our room, she had written Matthew's name out in seven different types of penmanship, folded the paper furtively, tucked it into her mouth, and nestled it in the pouch of her cheek.
zh_cn: 楼上我们的房间里，她用七种不同的笔法在纸上写下马修的名字，偷偷叠好，吃进嘴里，鼓起脸颊，把它窝在里面。

source: Last week, Matthew had proposed to her here at this very vat, with me as a witness.
zh_cn: 上个星期，马修就在这只染缸这儿向她求了婚，我算是证人。

source: I could hear him ask her, behind my back, as it were.
zh_cn: 我能听见他问她，这是自然的，就在我们背后。

source: "I'd uh-oh-oblige yuh-you to be my wife," he had mumbled. "With much honor," he'd added.
zh_cn: “我 呃-呦-强求你做我的妻子，”他口齿不清地说，“不胜荣幸，”他又加了一句。

source: Her answer hadn't been a yes or a no, but a squeal.
zh_cn: 她的回答既不是“是”也不是“不”，而是一声尖叫。

source: He'd interpreted it as an assent; I'd interpreted it as idiocy.
zh_cn: 对此，他视为同意，我视为白痴。

source: On our walk home she'd repeated: "I'm so happy. I'm so happy."
zh_cn: 回家的路上，她不停地说：“我太幸福了。我太幸福了。”

source: Like if she said it enough she could forget his use of oblige and could pretend that marriage was an option for her, us.
zh_cn: 就好像只要说得次数够多，她就能够忘掉他用了“强求”这个词儿，就能够假装她，我们，是可以有婚姻的。

source: In bed that night, the sheets had rustled and the backs of her thighs had brushed against mine.
zh_cn: 那天夜里，床上的床单沙沙作响，她的大腿后部擦碰着我的。

source: I'd squeezed my eyes shut, pretending that I didn't know she was touching herself.
zh_cn: 我紧紧闭着眼睛，假装自己不知道她正在抚摸自己。

source: "Matthew," she'd whispered into her pillow.
zh_cn: “马修，”她冲着自己的枕头低语着。

source: Muh-muh-Matthew, I'd repeated in my head.
zh_cn: 马-马-马修，我脑中一遍遍地说着。

source: A crunch in the gravel, and someone rounded the vat.
zh_cn: 碎石嘎吱作响，有人绕到这只染缸这儿来了。

source: I looked up eagerly, hoping it was the line boss, or even Father.
zh_cn: 我急切地望去，希望是车间经理，甚至父亲也行啊。

source: I pictured his face wide with outrage.
zh_cn: 我想象着他脸上的狂怒。

source: Farewell, lovers.
zh_cn: 再见，爱人们。

source: But Matthew pulled away from Hattie with an easy grin.
zh_cn: 但是马修轻松地笑着，从海蒂那儿脱开身。

source: He jumped to his feet and clapped his hand on the shoulder of a slumped, pocked version of himself, with a face, astoundingly, even duller.
zh_cn: 他跳了起来，用手拍打着一个肩膀，那是另一个消沉、布满痘痕的他，那张面孔，实在令人惊奇，竟然更为呆滞。

source: "Toby!"
zh_cn: “托比！”

source: Matthew said, glancing pointedly at Hattie, who dragged us both to our feet, almost tipping from my reluctant weight.
zh_cn: 马修说着，眼睛瞟向海蒂。她把我们俩拖拽了起来，我不情不愿，她几乎被我的重量拉翻在地。

source: "Hello, Toby," she said brightly.
zh_cn: “你好，托比，”她乐呵呵地说。

source: Toby's eyes passed over her.
zh_cn: 托比的眼睛越过她。

source: "Five minutes," he said to Matthew.
zh_cn: “五分钟，”他对马修说。

source: "That's all I got."
zh_cn: “我只有那么多时间。”

source: "Nah!"
zh_cn: “得了吧！”

source: Matthew countered, jostling him.
zh_cn: 马修反驳道，推搡着他。

source: "Stay a while.
zh_cn: “多呆会儿。

source: Ah-almost noon.
zh_cn: 快-快中午了。

source: Line bosses full of dinner, ah-ah-all sleepy."
zh_cn: 经理们吃饱了饭，都-都-都打瞌睡呢。”

source: Toby shifted his weight between his feet.
zh_cn: 托比两只脚轮换支撑着身体。

source: I assumed he'd been forced here to meet Hattie, so I wasn't prepared when, with a little ta-dah! of her arms, Hattie presented me.
zh_cn: 我猜想他是被逼着到这儿来见见海蒂的，因此海蒂用她的胳膊示意着“来喽！”，并且引荐我时，我毫无准备。

source: "Toby, you know my sister, Sylvie.
zh_cn: “托比，你认识我妹妹，西尔维。

source: And Sylvie, this is Matthew's brother, Toby."
zh_cn: 西尔维，这是马修的弟弟，托比。”

source: Matchmaking!
zh_cn: 做媒！

source: No, truly, matchmaking.
zh_cn: 不，真的，真是做媒。

source: The town wouldn't let the two of them marry with me joined up for the ride.
zh_cn: 镇子上不会让他俩结婚还顺带捎上我的。

source: So this was their scheme?
zh_cn: 那么这就是他们的谋划？

source: Join up another?
zh_cn: 再拽上另一个？

source: I could've cried. Instead I was mean.
zh_cn: 我完全可以大叫，但是我没有，我表现得很恶毒。

source: The cursed are cruel.
zh_cn: 被诅咒的人是残忍的。

source: "No," I said belligerently. "We haven't met."
zh_cn: “不，”我挑衅地说，“我们没见过。”

source: "Yes, you have," Hattie insisted.
zh_cn: “是的，你们见过，”海蒂坚持说道。

source: "At the picnic last month.
zh_cn: “上个月野餐的时候。

source: I remember him fetching you lemonade."
zh_cn: 我记得他给你拿了柠檬汽水。”

source: "I don't like lemonade," I muttered, just as Toby said, "I don't fetch lemonade."
zh_cn: “我不喜欢柠檬汽水，”我咕哝着，正好托比也说，“我没拿柠檬汽水。”

source: "Oh!"
zh_cn: “哎！”

source: Hattie breathed.
zh_cn: 海蒂出了口气。

source: "You even talk the same!"
zh_cn: “你们说话都一样呢！”

source: I reached behind and pinched her hip through her skirt, hoping the fabric wouldn't protect her.
zh_cn: 我把手伸到后面，隔着她的裙子掐她的屁股，但愿这衣服对她起不到保护作用。

source: "Yeah, the same," Matthew echoed, a dim grin on his face.
zh_cn: “是啊，一样，”马修随声附和，脸上笑意隐约。

source: "Lemonade is piss," I snarled.
zh_cn: “柠檬汽水就是尿，”我怒喊。

source: Hattie gasped, "Sylvie!" She dug her fingernails into my wrist.
zh_cn: 海蒂抽了口气，“西尔维！”她的指甲掐进了我的手腕。

source: To the boys, "She says things.
zh_cn: 她朝男孩们说，“她说话就这样。

source: Please don't listen!"
zh_cn: 别听她的！”

source: "A long, hot piss," I said.
zh_cn: “又长又热的尿，”我说。

source: Toby stared at me a moment and then laughed a thick laugh, like uncombed wool.
zh_cn: 托比瞪视了我一会儿，然后发出一阵混浊的笑声，就像一团乱毛。

source: At his brother's laugh, Matthew beamed, and Hattie loosened her grip on my wrist.
zh_cn: 听见他兄弟的笑声，马修微笑了，海蒂松开了我的手腕。

source: "Yuh-you're funny, Sylvie," Matthew said.
zh_cn: “尼-你真好玩，西尔维，”马修说。

source: Toby smiled at me.
zh_cn: 托比向我微笑。

source: I scowled back.
zh_cn: 我怒视回去。

source: "See?"
zh_cn: “瞧见没？”

source: Toby said.
zh_cn: 托比说。

source: "She doesn't want to be here either.
zh_cn: “她也不想在这儿。

source: Forget it, Matthew, both of you.
zh_cn: 算了吧，马修，你们俩。

source: We're not going to be part of this plan.
zh_cn: 我们可不打算成为这个计划的一部分。

source: Right, sister?"
zh_cn: 对吗，姐们儿？”

source: "I'm not your sister," I said.
zh_cn: “我不是你的姐们儿，”我说。

source: "I'm hers.
zh_cn: “我是她的姐们儿。

source: And you're right.
zh_cn: 不过你说得对。

source: I wouldn't marry you for anything.
zh_cn: 我怎么也不会嫁给你的。

source: Not love or money.
zh_cn: 不是爱情也不是钱。

source: You're much too dull."
zh_cn: 你太呆了。”

source: Toby's lip curled.
zh_cn: 托比的嘴唇弯了起来。

source: "By dull, I guess you mean 'normal.'
zh_cn: “你说‘呆’，我猜你的意思是‘正常’。”

source: "I lunged at him then, my fingers curled into claws.
zh_cn: 我立时冲向他，五指弯成了爪子。

source: Hattie still had a hold of my wrist, pulled it back toward us.
zh_cn: 海蒂的手还在我的手腕上，使劲把它朝着我们自己拉。

source: I imagined my nails digging into the pocks on his cheeks, but in the end I let her pull me away.
zh_cn: 我想象自己的指甲挖进了他脸颊上的痘痕里，可最终还是让她把我拉开了。

source: "Why'd yuh-you have to say that?"
zh_cn: “尼-你干嘛非得说那个？”

source: I heard Matthew ask his brother.
zh_cn: 我听见马修问他弟弟。

source: I was tugged back through the maze of vats.
zh_cn: 我被奋力拉着穿过布满染缸的曲径。

source: I felt a sudden pang of sympathy for Hattie, who had the misfortune of being in love.
zh_cn: 我突然对海蒂感到一阵同情，她真不幸，坠入了爱河。

source: She sniffed, once, twice.
zh_cn: 她抽着鼻子，一次，两次。

source: "Sorry," I mumbled.
zh_cn: “抱歉，”我咕哝了一声。

source: "You're not."
zh_cn: “才怪！”

source: "No, I'm not," I agreed.
zh_cn: “是，我不抱歉，”我同意。

source: "I just don't want-" "Want," she repeated.
zh_cn: “我只是不想——”“想，”她重复道。

source: "I could tell you about want."
zh_cn: “我能告诉你什么是想。”

source: HATTIE AND I are identical right down to our freckled shoulders, fat pinky toes, and the comb-eating snarls in our hair.
zh_cn: 海蒂和我模样完全一样，布满雀斑的肩膀、肥胖粉红的脚趾头，还有极难梳理的乱发。

source: We were born 17 years ago during a thunderstorm.
zh_cn: 我们17年前在雷雨中出生。
